# 01 - PEP 8
#
# *PEP - Python Enhancement Proposal это документ, в котором предлагаются изменения, улучшения или стандарты для языка Python.
# Он может содержать: другим языком можно сказать Python Enhancement Proposal это то что вы найдете на сайте python.org это
# предложение об улучшении языка, соответственно кто угодно может предложить что та что может добавлено в синтаксис языка
# в функционал языка, это обычна такая прям конкретное хорошая статья в которой описаны почему это нужно какие варианты
# реализации, на чем основаны эти идеи, на чем основаны все предложении и.т.д
#
# *"A Foolish Consistency is the Hobgoblin of little Minds" - стиль важен, но здравый смысл — важнее. Иногда лучше отступить
# от строгого правила, если так код станет понятнее.
#
# *PEP 8 - Style Guide for Python Code
# 4 пробела
# 79 символов
# 2 строки на 1 уровне, глубже - 1 строка
# camelCase в классах, underscored_name во всем остальном